bit-finance/DataProcessors/бит_СводныйБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_СводныйБюджет</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компоновщик</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантВывода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборБюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

bit-finance/AccumulationRegisters/бит_ОборотыПоБюджетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бит_ОборотыПоБюджетам</Name>
			<Comment>(БИТ)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте операции</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСценарий</Name>
					<Comment>Сумма в валюте сценария</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьСтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючСценарийЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_КлючиСценарийЦФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыЗаписейОборотовПоБюджетам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОборота</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОборотовОборотыПоБюджетам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Сценарий бюджетирования</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Comment>ЦФО</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Comment>Статья оборотов по бюджетам</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_1</Name>
					<Comment>Дополнительная аналитика № 1</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_2</Name>
					<Comment>Дополнительная аналитика № 2</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_3</Name>
					<Comment>Дополнительная аналитика № 3</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_4</Name>
					<Comment>Дополнительная аналитика № 4</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_5</Name>
					<Comment>Дополнительная аналитика № 5</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_6</Name>
					<Comment>Дополнительная аналитика № 6</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_7</Name>
					<Comment>Дополнительная аналитика № 7</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_8</Name>
					<Comment>Дополнительная аналитика № 8</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_9</Name>
					<Comment>Дополнительная аналитика № 9</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_10</Name>
					<Comment>Дополнительная аналитика № 10</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_11</Name>
					<Comment>Дополнительная аналитика № 11</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_12</Name>
					<Comment>Дополнительная аналитика № 12</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

bit-finance/InformationRegisters/бит_СтатусыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_СтатусыОбъектов</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПредыдущий</Name>
					<Comment>Статус предыдущий</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИзмененияСтатуса</Name>
					<Comment>Дата изменения статуса</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ОбъектыСоСтатусами</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/Enums/бит_ПериодичностьПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ПериодичностьПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Catalogs/СценарииПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СценарииПланирования</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта сценарий</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Периодичность</Name>
					<Comment>Периодичность планирования</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ПериодичностьПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьИнтервала</Name>
					<Comment>Продолжительность интервала планирования (количество периодов планирования)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьКонтроля</Name>
					<Comment>Периодичность контроля</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ПериодичностьПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКурсыСценария</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТиповойСценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииТоварногоПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьКонтрольЗаявокПоЛимитам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьКонтрольГрафиковДоговоровПоЛимитам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/DataProcessors/бит_СводныйБюджет/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Функция - Конструктор параметра функции ЗаполнитьСводныйБюджет.
// 
// Возвращаемое значение:
//  Структура - параметры получения табличных документов:
//   * НастройкиКомпоновщика  - НастройкиКомпоновкиДанных  - настройки компоновщика данных для СКД
//   * СхемаКомпоновкиДанных - Строка - адрес хранения СКД
//
Функция НовыеПараметрыЗаполненияСводногоБюджета() Экспорт
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("НастройкиКомпоновщика", Новый НастройкиКомпоновкиДанных);
	ПараметрыЗаполнения.Вставить("СхемаКомпоновкиДанных", Неопределено);
	ПараметрыЗаполнения.Вставить("Сценарий",              Справочники.СценарииПланирования.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("Периодичность",         Перечисления.бит_ПериодичностьПланирования.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("Период",                Новый СтандартныйПериод);
	ПараметрыЗаполнения.Вставить("Валюта",                Справочники.Валюты.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("ВыводитьСумму",         Ложь);
	ПараметрыЗаполнения.Вставить("ВыводитьКоличество",    Ложь);
	ПараметрыЗаполнения.Вставить("ВыводитьКодификатор",   Истина);
	ПараметрыЗаполнения.Вставить("ПоляГруппировок",       Новый ТаблицаЗначений);
	ПараметрыЗаполнения.Вставить("ВариантВывода",         0);
	ПараметрыЗаполнения.Вставить("ОтборБюджет",           Справочники.бит_Бюджеты.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("Сортировка",            "Кодификатор");
	ПараметрыЗаполнения.Вставить("ИспользоватьКоэффициентыСтатей", Ложь);
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

// Процедура получает при помощи СКД таблицу сводного бюджета.
//
// Параметры:
//  ПараметрыЗаполнения	 - Структура - см. НовыеПараметрыЗаполненияСводногоБюджета().
//  АдресВХранилище		 - Строка	 - Адрес временного хранилища результатов заполнения таблицы.
//
Процедура ЗаполнитьСводныйБюджет(ПараметрыЗаполнения, АдресВХранилище = "") Экспорт
	
	РезультатЗаполнения = Новый Структура;
	РезультатЗаполнения.Вставить("ДанныеРасшифровки");
	РезультатЗаполнения.Вставить("РезультатТабличныйДокумент");
	РезультатЗаполнения.Вставить("ТаблицаИерархии");
	РезультатЗаполнения.Вставить("СхемаКомпоновкиДанных");
	РезультатЗаполнения.Вставить("КолонкаИтогСумма", 0);
	РезультатЗаполнения.Вставить("КолонкаИтогКоличество", 0);
	РезультатЗаполнения.Вставить("СтрокаОбщиеИтоги", 0);
	
	Схема     = ПараметрыЗаполнения.СхемаКомпоновкиДанных;
	Настройки = ПараметрыЗаполнения.НастройкиКомпоновщика;
	
	НастроитьПоляИГруппировки(Настройки, ПараметрыЗаполнения);
	НастроитьСортировкуСтатей(Настройки, ПараметрыЗаполнения);
	УстановитьПараметрыСхемы(Схема, Настройки, ПараметрыЗаполнения);
	
	СводнаяТаблицаБюджета = СводнаяТаблицаБюджета(ПараметрыЗаполнения);
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("СводнаяТаблицаБюджета", СводнаяТаблицаБюджета);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(Схема, Настройки, ДанныеРасшифровки);
	
	РезультатЗаполнения.СхемаКомпоновкиДанных = Схема;
		
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.ОтображатьПроцентВывода = Истина;
	РезультатТабличныйДокумент = Новый ТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(РезультатТабличныйДокумент); 	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	РезультатЗаполнения.ДанныеРасшифровки          = ДанныеРасшифровки;
	РезультатЗаполнения.РезультатТабличныйДокумент = РезультатТабличныйДокумент;
	
	РезультатЗаполнения.ТаблицаИерархии = ИерархияТабличногоДокумента(РезультатТабличныйДокумент);
	
	РезультатЗаполнения.СтрокаОбщиеИтоги = РезультатТабличныйДокумент.ВысотаТаблицы;
	КоличествоКолонок = РезультатТабличныйДокумент.ШиринаТаблицы;
	Если ПараметрыЗаполнения.ВыводитьСумму
		И ПараметрыЗаполнения.ВыводитьКоличество Тогда
		РезультатЗаполнения.КолонкаИтогСумма      = КоличествоКолонок - 1;
		РезультатЗаполнения.КолонкаИтогКоличество = КоличествоКолонок;
	ИначеЕсли ПараметрыЗаполнения.ВыводитьСумму Тогда
		РезультатЗаполнения.КолонкаИтогСумма      = КоличествоКолонок;
	ИначеЕсли ПараметрыЗаполнения.ВыводитьКоличество Тогда
		РезультатЗаполнения.КолонкаИтогКоличество = КоличествоКолонок;
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатЗаполнения, АдресВХранилище);
	
КонецПроцедуры

// Функция - Конструктор параметра функции СформироватьБюджетныеОперации.
// 
// Возвращаемое значение:
//  Структура - параметры получения табличных документов:
//   * НастройкиКомпоновщика  - НастройкиКомпоновкиДанных  - настройки компоновщика данных для СКД
//   * СхемаКомпоновкиДанных - Строка - адрес хранения СКД
//
Функция НовыеПараметрыФормированияБюджетныхОпераций() Экспорт
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Сценарий",             Справочники.СценарииПланирования.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("Валюта",               Справочники.Валюты.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("ТаблицаБюджта",        Новый ТаблицаЗначений);
	ПараметрыЗаполнения.Вставить("АналитикиДетализации", Новый Массив);
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

// Процедура получает при помощи СКД таблицу сводного бюджета.
//
// Параметры:
//  ПараметрыЗаполнения	 - Структура - см. НовыеПараметрыФормированияБюджетныхОпераций().
//  АдресВХранилище		 - Строка	 - Адрес временного хранилища результатов заполнения таблицы.
//
Процедура СформироватьБюджетныеОперации(ПараметрыЗаполнения, АдресВХранилище = "") Экспорт
	
	РезультатЗаполнения = Новый Структура;
	РезультатЗаполнения.Вставить("СозданныеДокументы");
	
	Сценарий             = ПараметрыЗаполнения.Сценарий;
	Валюта               = ПараметрыЗаполнения.Валюта;
	ТаблицаБюджта        = ПараметрыЗаполнения.ТаблицаБюджта;
	АналитикиДетализации = ПараметрыЗаполнения.АналитикиДетализации;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&ПоляТаблицыБюджета
	|ПОМЕСТИТЬ ТаблицаБюджта
	|ИЗ
	|	&ТаблицаБюджта КАК ТаблицаБюджта";
	ШаблонПоляВыборки = "ТаблицаБюджта.%1 КАК %1";
	ПоляВыборки       = Новый Массив;
	Для каждого КолонкаБюджета Из ТаблицаБюджта.Колонки Цикл
		Если НЕ ЗначениеЗаполнено(КолонкаБюджета.ТипЗначения) Тогда
			Продолжить;
		КонецЕсли;
		ПоляВыборки.Добавить(СтрШаблон(ШаблонПоляВыборки, КолонкаБюджета.Имя));
	КонецЦикла;
	ПоляТаблицыБюджета = СтрСоединить(ПоляВыборки, "," + Символы.ПС + Символы.Таб);
	ТекстЗапроса       = СтрЗаменить(ТекстЗапроса, "&ПоляТаблицыБюджета", ПоляТаблицыБюджета);
	Запрос.Текст       = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТаблицаБюджта", ТаблицаБюджта);
	Запрос.Выполнить();
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&ПоляТаблицыБюджета
	|ИЗ
	|	ТаблицаБюджта КАК ТаблицаБюджта";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляТаблицыБюджета", ПоляТаблицыБюджета);
	
	КоличествоГруппировок          = АналитикиДетализации.Количество();
	РазбиватьДокументыПоАналитикам = (КоличествоГруппировок > 0);
	
	Если РазбиватьДокументыПоАналитикам Тогда
		ТекстЗапроса = ТекстЗапроса +
		"
		|ИТОГИ ПО
		|	" + СтрСоединить(АналитикиДетализации, "," + Символы.ПС + Символы.Таб);
	КонецЕсли;	
	Запрос.Текст     = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	СозданныеДокументы = Новый СписокЗначений;
	Если НЕ РазбиватьДокументыПоАналитикам Тогда
		ПараметрыБюджетнойОперации = Новый Структура;
		ПараметрыБюджетнойОперации.Вставить("Сценарий",        Сценарий);
		ПараметрыБюджетнойОперации.Вставить("ВалютаДокумента", Валюта);
		ВыборкаБюджета = РезультатЗапроса.Выбрать();
		СформироватьБюджетнуюОперацию(ВыборкаБюджета, ПараметрыБюджетнойОперации, СозданныеДокументы);
	Иначе
		ПараметрыБюджетнойОперации = Новый Структура(СтрСоединить(АналитикиДетализации, ","));
		ПараметрыБюджетнойОперации.Вставить("Сценарий",        Сценарий);
		ПараметрыБюджетнойОперации.Вставить("ВалютаДокумента", Валюта);
		СформироватьБюджетнуюОперациюРекурсивно(РезультатЗапроса, ПараметрыБюджетнойОперации, 1, КоличествоГруппировок, СозданныеДокументы);
	КонецЕсли;
	РезультатЗаполнения.СозданныеДокументы = СозданныеДокументы;
	
	ПоместитьВоВременноеХранилище(РезультатЗаполнения, АдресВХранилище);
	
КонецПроцедуры

Функция НаименованиеОбъектаСохраняемыхНастроек() Экспорт
	
	Возврат Метаданные.Обработки.бит_СводныйБюджет.ПолноеИмя();
	
КонецФункции

Функция НовыеПараметрыЗаполненияДанныхБюджетаПоАналитикам() Экспорт
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ТаблицаИзменений", Новый ТаблицаЗначений);
	ПараметрыЗаполнения.Вставить("НачалоПериода",    '00010101');
	ПараметрыЗаполнения.Вставить("ОкончаниеПериода", '00010101');
	ПараметрыЗаполнения.Вставить("Сценарий",         Справочники.СценарииПланирования.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("Валюта",           Справочники.Валюты.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("Аналитики",        Новый Структура);
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

Процедура ЗаполнитьДанныеБюджетаПоАналитикам(ТаблицаПриемник, ПараметрыЗаполнения) Экспорт
	
	ЗаполнитьБюджетПоДаннымРегистра(ТаблицаПриемник, ПараметрыЗаполнения);
	
	Для каждого СтрокаИстоник Из ПараметрыЗаполнения.ТаблицаИзменений Цикл
		НоваяСтрокаПриемника = ТаблицаПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаПриемника, СтрокаИстоник);
	КонецЦикла;
	
КонецПроцедуры

Функция ПриведеннаяСхемаКомпоновки(НастройкаПолей = Неопределено) Экспорт
	
	СхемаКомпоновкиДанных = Обработки.бит_СводныйБюджет.ПолучитьМакет("СхемаКомпоновкиДанных");
	ДобавитьПоляАналитикВНаборДанных(СхемаКомпоновкиДанных);
	УстановитьОграниченияАналитик(СхемаКомпоновкиДанных, НастройкаПолей);
	Возврат СхемаКомпоновкиДанных;
	
КонецФункции

Функция ФормироватьВРазрезеБюджета(ВариантВывода) Экспорт
	
	Возврат (ВариантВывода = 1);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеСводногоБюджета

Функция ИерархияТабличногоДокумента(ТабличныйДокумент)
	
	ТипЧисло        = Новый ОписаниеТипов("Число");
	ТаблицаИерархии = Новый ТаблицаЗначений;
	ТаблицаИерархии.Колонки.Добавить("Группа",    ТипЧисло);
	ТаблицаИерархии.Колонки.Добавить("Начало",    ТипЧисло);
	ТаблицаИерархии.Колонки.Добавить("Окончание", ТипЧисло);
	
	ДокументXDTO = СериализаторXDTO.ЗаписатьXDTO(ТабличныйДокумент);
	ТаблицаГрупп = ДокументXDTO.vg;
	Для каждого СтрокаГруппы Из ТаблицаГрупп Цикл
		НачалоГруппы    = СтрокаГруппы.b;
		ОкончаниеГруппы = СтрокаГруппы.e;
		
		СтрокаИерархии = ТаблицаИерархии.Добавить();
		СтрокаИерархии.Группа = НачалоГруппы;
		СтрокаИерархии.Начало = НачалоГруппы + 1;
		Если ЗначениеЗаполнено(ОкончаниеГруппы) Тогда
			СтрокаИерархии.Окончание = ОкончаниеГруппы + 1;
		Иначе
			СтрокаИерархии.Окончание = НачалоГруппы + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаИерархии;
	
КонецФункции

Процедура НастроитьПоляИГруппировки(Настройки, ПараметрыЗаполнения)
	
	ПолеСумма      = Новый ПолеКомпоновкиДанных("Сумма");
	ПолеКоличество = Новый ПолеКомпоновкиДанных("Количество");
	Для каждого ВыбранноеПоле Из Настройки.Выбор.Элементы Цикл
		Если ВыбранноеПоле.Поле = ПолеСумма Тогда
			ВыбранноеПоле.Использование = ПараметрыЗаполнения.ВыводитьСумму;
		ИначеЕсли ВыбранноеПоле.Поле = ПолеКоличество Тогда
			ВыбранноеПоле.Использование = ПараметрыЗаполнения.ВыводитьКоличество;
		КонецЕсли;
	КонецЦикла;
	
	КоллекцияЭлементовСтруктуры = Настройки.Структура[0].Строки;
	КоллекцияЭлементовСтруктуры.Очистить();
	
	Для каждого СтрокаГруппировки Из ПараметрыЗаполнения.ПоляГруппировок Цикл
		Если НЕ СтрокаГруппировки.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяГруппировка = КоллекцияЭлементовСтруктуры.Добавить();
		НоваяГруппировка.Использование = Истина;
		
		КоллекцияПолей = НоваяГруппировка.ПоляГруппировки.Элементы;
		
		ПолеГруппировки = КоллекцияПолей.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле           = Новый ПолеКомпоновкиДанных(СтрокаГруппировки.ИмяПоля);
		ПолеГруппировки.ТипГруппировки = СтрокаГруппировки.ТипГруппировки;
		ПолеГруппировки.Использование  = Истина;
		
		НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		НоваяГруппировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
		
		КоллекцияЭлементовСтруктуры    = НоваяГруппировка.Структура;
	КонецЦикла;
	
КонецПроцедуры

Процедура НастроитьСортировкуСтатей(Настройки, ПараметрыЗаполнения)
	
	ЭлементыПорядка = Настройки.Порядок.Элементы;
	ЭлементыПорядка.Очистить();
	
	ЭлементСортировки = ЭлементыПорядка.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ШаблонСортировки = "%1.%2";
	Если ФормироватьВРазрезеБюджета(ПараметрыЗаполнения.ВариантВывода) Тогда
		ПолеСортировки = "СтатьяБюджета";
	Иначе
		ПолеСортировки = "СтатьяОборотов";
	КонецЕсли;
	ПолеСортировки = СтрШаблон(ШаблонСортировки, ПолеСортировки, ПараметрыЗаполнения.Сортировка);
	ЭлементСортировки.Поле = Новый ПолеКомпоновкиДанных(ПолеСортировки);
	
	ЭлементыПорядка.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	
КонецПроцедуры

Процедура УстановитьПараметрыСхемы(Схема, Настройки, ПараметрыЗаполнения)
	
	Если Настройки.ПараметрыДанных.Элементы.Найти("ВыводитьКодификатор") = Неопределено Тогда
		Схема.Параметры.ВыводитьКодификатор.Значение = ПараметрыЗаполнения.ВыводитьКодификатор;
	Иначе
		ПараметрыДанных = Настройки.ПараметрыДанных;
		ПараметрыДанных.УстановитьЗначениеПараметра("ВыводитьКодификатор", ПараметрыЗаполнения.ВыводитьКодификатор);
	КонецЕсли;
	
КонецПроцедуры

Функция СводнаяТаблицаБюджета(ПараметрыЗаполнения)
	
	ТаблицаПериодов = ТаблицаПериодов(ПараметрыЗаполнения);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПериодов.НачалоПериода КАК НачалоПериода,
	|	ТаблицаПериодов.ОкончаниеПериода КАК ОкончаниеПериода,
	|	ТаблицаПериодов.ПредставлениеПериода КАК ПредставлениеПериода
	|ПОМЕСТИТЬ ТаблицаПериодов
	|ИЗ
	|	&ТаблицаПериодов КАК ТаблицаПериодов";
	Запрос.УстановитьПараметр("ТаблицаПериодов", ТаблицаПериодов);
	Запрос.Выполнить();
	
	ТекстЗапроса = ТекстЗапросаМатрицаИзмеренийСводнойТаблицы(ПараметрыЗаполнения);
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	ТекстЗапроса = ТекстЗапроса + ТекстЗапросаВыборкиПолейСводнойТаблицы(ПараметрыЗаполнения);
	
	Запрос.УстановитьПараметр("Сценарий",         ПараметрыЗаполнения.Сценарий);
	Запрос.УстановитьПараметр("НачалоПериода",    ПараметрыЗаполнения.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ПараметрыЗаполнения.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Валюта",           ПараметрыЗаполнения.Валюта);
	Запрос.УстановитьПараметр("ОтборБюджет",      ПараметрыЗаполнения.ОтборБюджет);
	
	ПериодичностьОборотов = бит_Бюджетирование.ПериодДляРазворотаТаблицыЗапроса(ПараметрыЗаполнения.Периодичность);
	ТекстЗапроса          = СтрЗаменить(ТекстЗапроса, "Декада", ПериодичностьОборотов);
	Запрос.Текст          = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить();
	
КонецФункции

Функция ТаблицаПериодов(ПараметрыЗаполнения)
	
	ТаблицаПериодов = Новый ТаблицаЗначений;
	ТипДата         = Новый ОписаниеТипов("Дата", , ,
						Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	ТаблицаПериодов.Колонки.Добавить("Период",           ТипДата);
	ТаблицаПериодов.Колонки.Добавить("НачалоПериода",    ТипДата);
	ТаблицаПериодов.Колонки.Добавить("ОкончаниеПериода", ТипДата);
	ТаблицаПериодов.Колонки.Добавить("ПредставлениеПериода", Новый ОписаниеТипов("Строка", ,
															 Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)));
	
	Периодичность = ПараметрыЗаполнения.Периодичность;
	ДатаНачала    = ПараметрыЗаполнения.Период.ДатаНачала;
	ДатаОкончания = ПараметрыЗаполнения.Период.ДатаОкончания;
	
	ПараметрыДаты = Перечисления.бит_ПериодичностьПланирования.ПараметрыДатыПоПериодичности(ДатаНачала, Периодичность);
	Пока ПараметрыДаты.ДатаНачала <= ДатаОкончания Цикл
		НоваяСтрокаПериода = ТаблицаПериодов.Добавить();
		НоваяСтрокаПериода.Период               = ПараметрыДаты.ДатаНачала;
		НоваяСтрокаПериода.НачалоПериода        = ПараметрыДаты.ДатаНачала;
		НоваяСтрокаПериода.ОкончаниеПериода     = ПараметрыДаты.ДатаОкончания;
		НоваяСтрокаПериода.ПредставлениеПериода = ПредставлениеПериода(ПараметрыДаты.ДатаНачала,
													ПараметрыДаты.ДатаОкончания);
		
		ПараметрыДаты = Перечисления.бит_ПериодичностьПланирования.ПараметрыДатыПоПериодичности(
							ПараметрыДаты.ДатаОкончания + 1, Периодичность);
	КонецЦикла;
	
	Возврат ТаблицаПериодов;
	
КонецФункции

Функция ТекстЗапросаМатрицаИзмеренийСводнойТаблицы(ПараметрыЗаполнения)
	
	ПоляГруппировок = ПараметрыЗаполнения.ПоляГруппировок;
	
	ШаблонВыборкиИзИсточника =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаИсточник.Ссылка КАК %2
	|ПОМЕСТИТЬ Источник_%2
	|ИЗ
	|	%1 КАК ТаблицаИсточник
	|ГДЕ
	|	НЕ ТаблицаИсточник.ПометкаУдаления
	|	И &УсловиеОтбора";
	
	ШаблонПустойВыборки =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(%1.ПустаяСсылка) КАК %2
	|ПОМЕСТИТЬ Источник_%2";
	
	ТаблицыИсточники = Новый Массив;
	ШаблонИсточника  = "Источник_%1 КАК Источник_%1";
	ПоляВыбора       = Новый Массив;
	ШаблонПоляВыбора = "Источник_%1.%1 КАК %1";
	
	ТекстыИсточников = Новый Массив;
	Для каждого СтрокаГруппы Из ПоляГруппировок Цикл
		Если СтрокаГруппы.ИмяПоля = "СтатьяБюджета" Тогда
			ТекстИсточника =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТаблицаИсточник.Ссылка КАК СтатьяБюджета,
			|	ТаблицаИсточник.СтатьяОборотов КАК СтатьяОборотов
			|ПОМЕСТИТЬ Источник_СтатьяБюджета
			|ИЗ
			|	Справочник.бит_СтатьиБюджета КАК ТаблицаИсточник
			|ГДЕ
			|	НЕ ТаблицаИсточник.ЭтоГруппа
			|	И НЕ ТаблицаИсточник.ПометкаУдаления
			|	И ТаблицаИсточник.Владелец = &ОтборБюджет";
			ТекстыИсточников.Добавить(ТекстИсточника);
			
			ПоляВыбора.Добавить("Источник_СтатьяБюджета.СтатьяБюджета КАК СтатьяБюджета");
			ПоляВыбора.Добавить("Источник_СтатьяБюджета.СтатьяОборотов КАК СтатьяОборотов");
			
			ТаблицыИсточники.Добавить("Источник_СтатьяБюджета КАК Источник_СтатьяБюджета");
			Продолжить;
		КонецЕсли;
		
		МетаданныеСправочника = Метаданные.НайтиПоПолномуИмени(СтрокаГруппы.ИмяМетаданных);
		
		ТекстИсточника = "";
		УсловиеОтбора  = "";
		Если СтрокаГруппы.Использование Тогда
			ТекстИсточника = ШаблонВыборкиИзИсточника;
			Если МетаданныеСправочника.Иерархический
				И МетаданныеСправочника.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
				УсловиеОтбора = "НЕ ТаблицаИсточник.ЭтоГруппа";
			Иначе
				УсловиеОтбора = "ИСТИНА";
			КонецЕсли;
			ТекстИсточника = СтрЗаменить(ТекстИсточника, "&УсловиеОтбора", УсловиеОтбора);
		Иначе
			ТекстИсточника = ШаблонПустойВыборки;
		КонецЕсли;
		
		ТекстИсточника = СтрШаблон(ТекстИсточника, СтрокаГруппы.ИмяМетаданных, СтрокаГруппы.ИмяПоля);
		ТекстыИсточников.Добавить(ТекстИсточника);
		
		ТекстВыборкиПоляИсточника = СтрШаблон(ШаблонПоляВыбора, СтрокаГруппы.ИмяПоля);
		ПоляВыбора.Добавить(ТекстВыборкиПоляИсточника);
		
		ТекстВыборкиИсточника = СтрШаблон(ШаблонИсточника, СтрокаГруппы.ИмяПоля);
		ТаблицыИсточники.Добавить(ТекстВыборкиИсточника);
	КонецЦикла;
	
	ТекстЗапроса = СтрСоединить(ТекстыИсточников, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	ТаблицаПериодов.НачалоПериода КАК НачалоПериода,
	|	ТаблицаПериодов.ОкончаниеПериода КАК ОкончаниеПериода,
	|	ТаблицаПериодов.ПредставлениеПериода КАК ПредставлениеПериода,
	|	&ПоляВыбора КАК ПоляВыбора
	|ПОМЕСТИТЬ МатрицаИзмерений
	|ИЗ
	|	ТаблицаПериодов КАК ТаблицаПериодов,
	|	&ТаблицыИсточники КАК ТаблицыИсточники
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатьяОборотов";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
							"&ПоляВыбора КАК ПоляВыбора",
							СтрСоединить(ПоляВыбора, "," + Символы.ПС + Символы.Таб));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
							"&ТаблицыИсточники КАК ТаблицыИсточники",
							СтрСоединить(ТаблицыИсточники, "," + Символы.ПС + Символы.Таб));
							
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВыборкиПолейСводнойТаблицы(ПараметрыЗаполнения)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОборотыПоБюджетам.Период КАК Период,
	|	&ПоляВыборкиОборотовБюджета,
	|	ОборотыПоБюджетам.СуммаОборот КАК Сумма,
	|	ОборотыПоБюджетам.КоличествоОборот КАК Количество
	|ПОМЕСТИТЬ ОборотыПоБюджетам
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам.Обороты(&НачалоПериода, &ОкончаниеПериода, Декада, Сценарий = &Сценарий И &ОтборВалюты) КАК ОборотыПоБюджетам";
	
	ПараметрыПересчета = ПараметрыПересчетаСуммыПоВалюте(ПараметрыЗаполнения);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"ОборотыПоБюджетам.СуммаОборот",
								ПараметрыПересчета.ТекстПоляВыборкиСуммы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"&ОтборВалюты",
								ПараметрыПересчета.ТекстОтбораВалюты);
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	МатрицаИзмерений.НачалоПериода КАК Период,
	|	МатрицаИзмерений.ОкончаниеПериода КАК ОкончаниеПериода,
	|	МатрицаИзмерений.ПредставлениеПериода КАК ПредставлениеПериода,
	|	&ПоляВыборкиИзмерений,
	|	&ПоляВыборкиПоказателей
	|ИЗ
	|	МатрицаИзмерений КАК МатрицаИзмерений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОборотыПоБюджетам КАК ОборотыПоБюджетам
	|		ПО &ПоляСоединения
	|			И МатрицаИзмерений.НачалоПериода = ОборотыПоБюджетам.Период";
	
	ПоляВыборкиОборотовБюджета = Новый Массив;
	ШаблонПоляВыборкиОборотов  = "ОборотыПоБюджетам.%1 КАК %1";
	ПоляВыборкиОборотовБюджета.Добавить(СтрШаблон(ШаблонПоляВыборкиОборотов, "СтатьяОборотов"));
	
	ПоляВыборкиИзмерений       = Новый Массив;
	ШаблонПоляВыборкиИзмерения = "МатрицаИзмерений.%1 КАК %1";
	ШаблонПустогоИзмерения     = "НЕОПРЕДЕЛЕНО КАК %1";
	ПоляВыборкиИзмерений.Добавить(СтрШаблон(ШаблонПоляВыборкиИзмерения, "СтатьяОборотов"));
	Если ФормироватьВРазрезеБюджета(ПараметрыЗаполнения.ВариантВывода) Тогда
		ПоляВыборкиИзмерений.Добавить(СтрШаблон(ШаблонПоляВыборкиИзмерения, "СтатьяБюджета"));
	Иначе
		ПоляВыборкиИзмерений.Добавить(СтрШаблон(ШаблонПустогоИзмерения, "СтатьяБюджета"));
	КонецЕсли;
	
	ПоляСоединения             = Новый Массив;
	ШаблонСоединения           = "МатрицаИзмерений.%1 = ОборотыПоБюджетам.%1";
	ПоляСоединения.Добавить(СтрШаблон(ШаблонСоединения, "СтатьяОборотов"));
	
	ПоляГруппировок            = ПараметрыЗаполнения.ПоляГруппировок;
	ИзмеренияБюджетирования    = Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам.Измерения;
	Для каждого Измерение Из ИзмеренияБюджетирования Цикл
		ИмяИзмерения = Измерение.Имя;
		Если ИмяИзмерения = "Сценарий" ИЛИ ИмяИзмерения = "Валюта" ИЛИ ИмяИзмерения = "СтатьяОборотов" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ГруппировкаИспользуется(ПоляГруппировок, ИмяИзмерения)	Тогда
			ПоляВыборкиОборотовБюджета.Добавить(СтрШаблон(ШаблонПоляВыборкиОборотов, ИмяИзмерения));
			ПоляВыборкиИзмерений.Добавить(СтрШаблон(ШаблонПоляВыборкиИзмерения, ИмяИзмерения));
			ПоляСоединения.Добавить(СтрШаблон(ШаблонСоединения, ИмяИзмерения));
		Иначе
			ПоляВыборкиИзмерений.Добавить(СтрШаблон(ШаблонПустогоИзмерения, ИмяИзмерения));
		КонецЕсли;
	КонецЦикла;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"&ПоляВыборкиОборотовБюджета",
								СтрСоединить(ПоляВыборкиОборотовБюджета, "," + Символы.ПС + Символы.Таб));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"&ПоляВыборкиИзмерений",
								СтрСоединить(ПоляВыборкиИзмерений, "," + Символы.ПС + Символы.Таб));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"&ПоляСоединения",
								СтрСоединить(ПоляСоединения, Символы.ПС + Символы.Таб + Символы.Таб + Символы.Таб + "И "));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляВыборкиПоказателей", ТекстПолейВыборкиПоказателей(ПараметрыЗаполнения));
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ГруппировкаИспользуется(ПоляГруппировок, ИмяГруппировки)
	
	СтрокаГруппировки = ПоляГруппировок.Найти(ИмяГруппировки, "ИмяПоля");
	Если СтрокаГруппировки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат СтрокаГруппировки.Использование;
	
КонецФункции

Функция ТекстПолейВыборкиПоказателей(ПараметрыЗаполнения)
	
	Если ПараметрыЗаполнения.ИспользоватьКоэффициентыСтатей
		И ФормироватьВРазрезеБюджета(ПараметрыЗаполнения.ВариантВывода) Тогда
		ШаблонПоля =
		"ЕСТЬNULL(ВЫБОР
		|	КОГДА МатрицаИзмерений.СтатьяБюджета.Коэффициент = 0 ТОГДА
		|		1
		|	ИНАЧЕ
		|		МатрицаИзмерений.СтатьяБюджета.Коэффициент
		|КОНЕЦ * ОборотыПоБюджетам.%1, 0) КАК %1";
		Возврат СтрШаблон(ШаблонПоля, "Сумма") + "," + Символы.ПС + СтрШаблон(ШаблонПоля, "Количество");
	КонецЕсли;
	
	Возврат "ЕСТЬNULL(ОборотыПоБюджетам.Сумма, 0) КАК Сумма,
	|	ЕСТЬNULL(ОборотыПоБюджетам.Количество, 0) КАК Количество";
	
КонецФункции

#КонецОбласти

#Область ФормированиеБюджетныхОпераций

Процедура СформироватьБюджетнуюОперацию(ВыборкаБюджета, ПараметрыБюджетнойОперации, СозданныеДокументы)
	
	БюджетнаяОперация = Документы.бит_БюджетнаяОперация.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(БюджетнаяОперация, ПараметрыБюджетнойОперации);
	БюджетнаяОперация.Дата = ТекущаяДатаСеанса();
	БюджетнаяОперация.Заполнить(Неопределено);
	БюджетнаяОперация.ВалютаДокумента = ПараметрыБюджетнойОперации.ВалютаДокумента;
	БюджетнаяОперация.ИзменениеВалютыОбъект();
	ЗаполнитьЗначенияСвойств(БюджетнаяОперация, ПараметрыБюджетнойОперации);
	Пока ВыборкаБюджета.Следующий() Цикл
		НоваяСтрокаБюджета = БюджетнаяОперация.БДДС.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаБюджета, ВыборкаБюджета);
	КонецЦикла;
	БюджетнаяОперация.Записать(РежимЗаписиДокумента.Проведение);
	СозданныеДокументы.Добавить(БюджетнаяОперация.Ссылка);
	
КонецПроцедуры

Процедура СформироватьБюджетнуюОперациюРекурсивно(ВыборкаРодитель, ПараметрыБюджетнойОперации, ТекущийУровень, КоличествоГруппировок, СозданныеДокументы)
	
	Выборка = ВыборкаРодитель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		Если ТекущийУровень = КоличествоГруппировок Тогда
			ВыборкаБюджета = Выборка.Выбрать();
			СформироватьБюджетнуюОперацию(ВыборкаБюджета, ПараметрыБюджетнойОперации, СозданныеДокументы);
		Иначе
			СформироватьБюджетнуюОперациюРекурсивно(Выборка, ПараметрыБюджетнойОперации, ТекущийУровень + 1, КоличествоГруппировок, СозданныеДокументы)	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеБюджетаПоАналиткам

Процедура ЗаполнитьБюджетПоДаннымРегистра(ТаблицаПриемник, ПараметрыЗаполнения)
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОборотыПоБюджетам.Регистратор КАК Регистратор,
	|	ОборотыПоБюджетам.ЦФО КАК ЦФО,
	|	ОборотыПоБюджетам.СтатьяОборотов КАК СтатьяОборотов,
	|	ОборотыПоБюджетам.Количество КАК Количество,
	|	&РесурсСумма КАК Сумма,
	|	ОборотыПоБюджетам.Комментарий КАК Комментарий,
	|	ИСТИНА КАК ТолькоЧтение,
	|	&ПоляАналитик КАК ПоляАналитик
	|ПОМЕСТИТЬ ОборотыПоБюджетам
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам КАК ОборотыПоБюджетам
	|ГДЕ
	|	ОборотыПоБюджетам.Активность
	|	И ОборотыПоБюджетам.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И ОборотыПоБюджетам.Сценарий = &Сценарий
	|	И &ОтборВалюты
	|	И &УсловияАналитик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОборотыПоБюджетам.Регистратор КАК Регистратор,
	|	ОборотыПоБюджетам.ЦФО КАК ЦФО,
	|	ОборотыПоБюджетам.СтатьяОборотов КАК СтатьяОборотов,
	|	ОборотыПоБюджетам.Количество КАК Количество,
	|	ОборотыПоБюджетам.Сумма КАК Сумма,
	|	ОборотыПоБюджетам.Комментарий КАК Комментарий,
	|	ОборотыПоБюджетам.ТолькоЧтение КАК ТолькоЧтение,
	|	СтатусыОбъектов.Статус КАК Статус,
	|	&ПоляАналитик КАК ПоляАналитик
	|ИЗ
	|	ОборотыПоБюджетам КАК ОборотыПоБюджетам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтатусыОбъектов КАК СтатусыОбъектов
	|		ПО ОборотыПоБюджетам.Регистратор = СтатусыОбъектов.Объект";
	Запрос.УстановитьПараметр("НачалоПериода"   , ПараметрыЗаполнения.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ПараметрыЗаполнения.ОкончаниеПериода);
	Запрос.УстановитьПараметр("Сценарий"        , ПараметрыЗаполнения.Сценарий);
	Запрос.УстановитьПараметр("Валюта"          , ПараметрыЗаполнения.Валюта);
	
	ПараметрыПересчета = ПараметрыПересчетаСуммыПоВалютеПлоскойТаблицыОборотов(ПараметрыЗаполнения);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"&РесурсСумма",
								ПараметрыПересчета.ТекстПоляВыборкиСуммы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"&ОтборВалюты",
								ПараметрыПересчета.ТекстОтбораВалюты);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"&ПоляАналитик КАК ПоляАналитик",
								ТекстЗапросаВыборкиПолейАналитик());
	
	ТекстУсловияАналитик = "ИСТИНА";
	ШаблонУсловия       = "ОборотыПоБюджетам.%1 = &%1";
	УсловияАналитик     = Новый Массив;
	Аналитики           = ПараметрыЗаполнения.Аналитики;
	Для каждого Аналитика Из Аналитики Цикл
		ИмяАналитики = Аналитика.Ключ;
		УсловияАналитик.Добавить(СтрШаблон(ШаблонУсловия, ИмяАналитики));
		Запрос.УстановитьПараметр(ИмяАналитики, Аналитика.Значение);
	КонецЦикла;
	Если УсловияАналитик.Количество() > 0 Тогда
		ТекстУсловияАналитик = СтрСоединить(УсловияАналитик, Символы.ПС + Символы.Таб + "И" + " ");
	КонецЕсли;
	ТекстЗапроса     = СтрЗаменить(ТекстЗапроса, "&УсловияАналитик", ТекстУсловияАналитик);
	Запрос.Текст     = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	Если ТипЗнч(ТаблицаПриемник) = Тип("ТаблицаЗначений") Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрокаПриемника = ТаблицаПриемник.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаПриемника, Выборка);
		КонецЦикла;
	Иначе
		ДвиженияРегистра = РезультатЗапроса.Выгрузить();
		ТаблицаПриемник.Загрузить(ДвиженияРегистра);
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаВыборкиПолейАналитик()
	
	ВыборкиАналитик   = Новый Массив;
	ШаблонВыборкиПоля = "ОборотыПоБюджетам.%1 КАК %1";
	Аналитики         = бит_МеханизмДопИзмерений.Аналитики();
	Для каждого ИмяАналитики Из Аналитики Цикл
		ВыборкиАналитик.Добавить(СтрШаблон(ШаблонВыборкиПоля, ИмяАналитики));
	КонецЦикла;
	ТекстВыборки = СтрСоединить(ВыборкиАналитик, "," + Символы.ПС + Символы.Таб);
	
	Возврат ТекстВыборки;
	
КонецФункции

#КонецОбласти

#Область ЗаполенениеПереопределяемыхАналитик

Процедура ДобавитьПоляАналитикВНаборДанных(СхемаКомпоновкиДанных)
	
	ПоляНабораДанных = СхемаКомпоновкиДанных.НаборыДанных.СводнаяТаблицаБюджета.Поля;
	Аналитики        = бит_МеханизмДопИзмерений.Аналитики(Истина);
	Для каждого ОписаниеАналитики Из Аналитики Цикл
		ИмяПоля = ОписаниеАналитики.Имя;
		
		ПолеАналитикиСКД = ПоляНабораДанных.Найти(ИмяПоля);
		Если ПолеАналитикиСКД <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПолеАналитикиСКД = ПоляНабораДанных.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		ПолеАналитикиСКД.Поле        = ИмяПоля;
		ПолеАналитикиСКД.ПутьКДанным = ИмяПоля;
		Если НЕ ОписаниеАналитики.Используется Тогда
			УстановитьОграниченияИспользованияПоляСКД(ПоляНабораДанных, ИмяПоля);
		Иначе
			ПолеАналитикиСКД.ТипЗначения = ОписаниеАналитики.ТипЗначения;
			ПолеАналитикиСКД.Заголовок   = ОписаниеАналитики.Синоним;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьОграниченияАналитик(СхемаКомпоновкиДанных, НастройкаПолей)
	
	ПоляНабораДанных      = СхемаКомпоновкиДанных.НаборыДанных.СводнаяТаблицаБюджета.Поля;
	НастройкиИзмерений    = бит_МеханизмДопИзмеренийПовтИсп.НастройкиДополнительныхИзмерений();
	КоличествоАналитик    = бит_МеханизмДопИзмерений.ПолучитьМаксимальноеКоличествоДополнительныхИзмерений();
	
	Для Сч = 1 По КоличествоАналитик Цикл
		ИмяАналитики = "Аналитика_"  + Сч;
		
		НастройкиИзмерения = НастройкиИзмерений.Получить(ИмяАналитики);
		Если НастройкиИзмерения = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПолеАналитикиСКД = ПоляНабораДанных.Найти(ИмяАналитики);
		УстановитьОграниченияИспользованияПоляСКД(ПоляНабораДанных, ИмяАналитики, Ложь);
		ПолеАналитикиСКД.Заголовок   = НастройкиИзмерения.Синоним;
		ПолеАналитикиСКД.ТипЗначения = НастройкиИзмерения.ТипЗначения;
	КонецЦикла;
	
	Если НастройкаПолей <> Неопределено Тогда
		Для каждого СтрокаНастройки Из НастройкаПолей Цикл
			ИмяАналитики     = СтрокаНастройки.ИмяПоля;
			ПолеАналитикиСКД = ПоляНабораДанных.Найти(ИмяАналитики);
			УстановитьОграниченияИспользованияПоляСКД(ПоляНабораДанных, ИмяАналитики, НЕ СтрокаНастройки.Использование);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция ПараметрыПересчетаСуммыПоВалюте(ПараметрыЗаполнения)
	
	ПраметрыПересчета = Новый Структура;
	ПраметрыПересчета.Вставить("ТекстПоляВыборкиСуммы", "ОборотыПоБюджетам.СуммаОборот");
	ПраметрыПересчета.Вставить("ТекстОтбораВалюты",     "ИСТИНА");
	
	Если ПараметрыЗаполнения.Валюта = Константы.бит_ВалютаУправленческогоУчета.Получить() Тогда
		ПраметрыПересчета.ТекстПоляВыборкиСуммы = "ОборотыПоБюджетам.СуммаУпрОборот";
	ИначеЕсли ПараметрыЗаполнения.Валюта = Константы.ВалютаРегламентированногоУчета.Получить() Тогда
		ПраметрыПересчета.ТекстПоляВыборкиСуммы = "ОборотыПоБюджетам.СуммаРеглОборот";
	ИначеЕсли ПараметрыЗаполнения.Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыЗаполнения.Сценарий,
																						"Валюта") Тогда
		ПраметрыПересчета.ТекстПоляВыборкиСуммы = "ОборотыПоБюджетам.СуммаСценарийОборот";
	Иначе
		ПраметрыПересчета.ТекстОтбораВалюты = "Валюта = &Валюта";
	КонецЕсли;
	
	Возврат ПраметрыПересчета;
	
КонецФункции

Функция ПараметрыПересчетаСуммыПоВалютеПлоскойТаблицыОборотов(ПараметрыЗаполнения)
	
	ПраметрыПересчета = Новый Структура;
	ПраметрыПересчета.Вставить("ТекстПоляВыборкиСуммы", "");
	ПраметрыПересчета.Вставить("ТекстОтбораВалюты",     "ИСТИНА");
	
	ПолеСуммы = "Сумма";
	Если ПараметрыЗаполнения.Валюта = Константы.бит_ВалютаУправленческогоУчета.Получить() Тогда
		ПолеСуммы = "СуммаУпр";
	ИначеЕсли ПараметрыЗаполнения.Валюта = Константы.ВалютаРегламентированногоУчета.Получить() Тогда
		ПолеСуммы = "СуммаРегл";
	ИначеЕсли ПараметрыЗаполнения.Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыЗаполнения.Сценарий,
																						"Валюта") Тогда
		ПолеСуммы = "СуммаСценарий";
	Иначе
		ПраметрыПересчета.ТекстОтбораВалюты = "ОборотыПоБюджетам.Валюта = &Валюта";
	КонецЕсли;
	
	ПраметрыПересчета.ТекстПоляВыборкиСуммы = "ОборотыПоБюджетам." + ПолеСуммы;
	
	Возврат ПраметрыПересчета;
	
КонецФункции

Процедура УстановитьОграниченияИспользованияПоляСКД(ПоляНабораДанных, ИмяПоля, Ограничение = Истина)
	
	ПолеАналитикиСКД = ПоляНабораДанных.Найти(ИмяПоля);
	Если ПолеАналитикиСКД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолеАналитикиСКД.ОграничениеИспользования.Группировка = Ограничение;
	ПолеАналитикиСКД.ОграничениеИспользования.Поле        = Ограничение;
	ПолеАналитикиСКД.ОграничениеИспользования.Порядок     = Ограничение;
	ПолеАналитикиСКД.ОграничениеИспользования.Условие     = Ограничение;	
	
	ПолеАналитикиСКД.ОграничениеИспользованияРеквизитов.Группировка = Ограничение;
	ПолеАналитикиСКД.ОграничениеИспользованияРеквизитов.Поле        = Ограничение;
	ПолеАналитикиСКД.ОграничениеИспользованияРеквизитов.Порядок     = Ограничение;
	ПолеАналитикиСКД.ОграничениеИспользованияРеквизитов.Условие     = Ограничение;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
